In [9]:
import pandas as pd

Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series ?

In [49]:
lis_ = [4,8,15,16,23,42]

In [52]:
series = pd.Series(lis_)

In [54]:
series

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [53]:
type(series)

pandas.core.series.Series

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it ?

In [55]:
list_1 = ['a','s','d','f','g','h','j','k','l','z']

In [57]:
series_var = pd.Series(list_1)

In [58]:
type(series_var)

pandas.core.series.Series

Q3. Create a Pandas DataFrame that contains the following data:

In [28]:
lis = [['Name' , 'Age' , 'Gender'] , ['Alice' , '25' , 'Female'] , ['Bob' , '30' , 'Male'] , ['Claire' , '27' , 'Female']]

In [30]:
df = pd.DataFrame(lis)

In [32]:
df

        0    1       2
0    Name  Age  Gender
1   Alice   25  Female
2     Bob   30    Male
3  Claire   27  Female

In [31]:
type(df)

pandas.core.frame.DataFrame

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example ?

Data frame is a structure formate of data and data is given in table pandas always read data as a table foramte.

Pandas series is a type of list like in python.

In [34]:
df #data Frame

        0    1       2
0    Name  Age  Gender
1   Alice   25  Female
2     Bob   30    Male
3  Claire   27  Female

In [61]:
s_1 = pd.Series('aditya') #series

In [62]:
s_1

0    aditya
dtype: object

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

The common function use to manipulate data in pandas DataFrame is :

1 - df.head()

2 - df.tail()

3 - df.columns

4 - df[['type name columns which columns you want to print']]

In [63]:
df.head(1)

      0    1       2
0  Name  Age  Gender

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

DataFrame , Panle 

IMPORTANT --- except Series all are mutable

Q7. Create a DataFrame using multiple Series. Explain with an example ?

In [68]:
list_2 = [1,2,3,4,5,6,7,8,7,5,4,567,65,45,76,5]

In [69]:
pd.Series(list_2)

0       1
1       2
2       3
3       4
4       5
5       6
6       7
7       8
8       7
9       5
10      4
11    567
12     65
13     45
14     76
15      5
dtype: int64